Revit 2027 API
Category.AllowsBoundParameters Property
 To check if the category can have project parameters.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool AllowsBoundParameters { get; }
Public ReadOnly Property AllowsBoundParameters As Boolean
	Get
public:
property bool AllowsBoundParameters {
	bool get ();
}
member AllowsBoundParameters : bool with get
Property Value
Boolean
See Also
Reference
Category Class
Autodesk.Revit.DB Namespace